# Transform Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Frame..::..Transform Method
Frame Class See Also
---
Applies the input transform to this frame.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public void Transform(
	Transform trf
)
```

Visual Basic
---
```text
Public Sub Transform ( _
	trf As Transform _
)
```

Visual C++
---
```text
public:
void Transform(
	Transform^ trf
)
```

# ### Parameters
trf
    Type: Autodesk.Revit.DB..::..Transform The transform to apply to the frame.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | this operation failed. |

# See Also
Frame Class
Autodesk.Revit.DB Namespace